InformationRegisters/НастройкиОтправкиЭлектронныхДокументовПоВидам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтправкиЭлектронныхДокументовПоВидам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаршрутПодписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыПодписания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяОтветнаяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяИзвещениеОПолучении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыгружатьДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Формировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматаУстановленаВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнениеКодаТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Comment>Адрес отправителя документов при прямом обмене</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Comment>Адрес получателя документов при прямом обмене</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменБезПодписи</Name>
					<Comment>Признак использования подписи при прямом обмене</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДоговорСКонтрагентомЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПрикладнойВидЭД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрикладныеТипыЭлектронныхДокументовЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/НастройкиОтправкиЭДОСлужебныйКлиент/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Выполняет настройку регламента ЭДО.
// 
// Параметры:
// 	ПараметрыНастройки - см. НовыеПараметрыНастройкиРегламентаЭДО
// 	Владелец - Произвольный
// 	Оповещение - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана
//               после завершения настройки со следующими параметрами:
//    * Настройка - Неопределено
//                - см. НастройкиЭДОКлиентСервер.НоваяНастройкаОтправки.
//    * ДополнительныеПараметры - Произвольный - значение, которое было указано при создании объекта ОписаниеОповещения.
Процедура НастроитьРегламентЭДО(ПараметрыНастройки, Владелец = Неопределено, Оповещение = Неопределено) Экспорт
	
	ПараметрыОткрытия = ОбщегоНазначенияБЭДКлиент.НовыеПараметрыОткрытияФормы();
	ПараметрыОткрытия.Владелец = Владелец;
	ПараметрыОткрытия.ОписаниеОповещенияОЗакрытии = Оповещение;
	ПараметрыОткрытия.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД("Обработка.НастройкиЭДО.Форма.НастройкаОбменаСКонтрагентом",
		ПараметрыНастройки, ПараметрыОткрытия);
		
КонецПроцедуры

// Возвращает параметры настройки регламента ЭДО.
// 
// Возвращаемое значение:
// 	Структура:
// * КлючНастроек - см. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
// * ИдентификаторОтправителя - Строка
// * ИдентификаторПолучателя - Строка
// * МаршрутПодписания - СправочникСсылка.МаршрутыПодписания
// * ВерсияФорматаУстановленаВручную - Булево
// * РасширенныйРежимНастройки - Булево
// * ЗаполнениеКодаТовара - Строка
// * ВыгружатьДопСведения - Булево
// * ТребуетсяПодтверждение - Булево
// * ТребуетсяИзвещение - Булево
// * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
// * Формат - Строка
// * НастройкаРегламентаЭДО - Булево - (служебное поле)
// * ПоказыватьДополнительныеНастройки - Булево
// * НастройкаДокумента - Булево
Функция НовыеПараметрыНастройкиРегламентаЭДО() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("КлючНастроек",                    НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки());
	Параметры.Вставить("ИдентификаторПолучателя",         "");
	Параметры.Вставить("ИдентификаторОтправителя",        "");
	Параметры.Вставить("Формат",                          "");
	Параметры.Вставить("ТребуетсяИзвещение",              Ложь);
	Параметры.Вставить("ТребуетсяПодтверждение",          Ложь);
	Параметры.Вставить("ВыгружатьДопСведения",            Ложь);
	Параметры.Вставить("ЗаполнениеКодаТовара",            "");
	Параметры.Вставить("НастройкаРегламентаЭДО",          Истина);
	Параметры.Вставить("РасширенныйРежимНастройки",       Ложь);
	Параметры.Вставить("ВерсияФорматаУстановленаВручную", Ложь);
	Параметры.Вставить("Формировать",                     Ложь);
	Параметры.Вставить("ОбменБезПодписи",                 Ложь);
	Параметры.Вставить("МаршрутПодписания",
		ПредопределенноеЗначение("Справочник.МаршрутыПодписания.ПустаяСсылка"));
	Параметры.Вставить("СпособОбмена",
		ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ПустаяСсылка"));
	Параметры.Вставить("ПоказыватьДополнительныеНастройки", Ложь);
	Параметры.Вставить("НастройкаДокумента", Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Открывает форму выбора учетных записей.
// 
// Параметры:
// 	ПараметрыВыбора - см. НовыеПараметрыТранспортныхНастроек
// 	Владелец - Произвольный
// 	Оповещение - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана
//               после завершения настройки со следующими параметрами:
//    * Настройка - Неопределено
//                - см. НастройкиЭДОКлиентСервер.НоваяНастройкаОтправки.
//    * ДополнительныеПараметры - Произвольный - значение, которое было указано при создании объекта ОписаниеОповещения.
// 	Настройки - см. НастройкиЭДОКлиентСервер.НоваяНастройкаОтправки
Процедура ОткрытьТранспортныеНастройкиОтправки(ПараметрыВыбора, Владелец = Неопределено, Оповещение = Неопределено,
	Настройки = Неопределено) Экспорт
	
	ПараметрыОткрытия = ОбщегоНазначенияБЭДКлиент.НовыеПараметрыОткрытияФормы();
	ПараметрыОткрытия.Владелец = Владелец;
	ПараметрыОткрытия.ОписаниеОповещенияОЗакрытии = Оповещение;
	ПараметрыОткрытия.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Если Настройки = Неопределено Тогда
		Настройки = НастройкиОтправкиЭДОСлужебныйВызовСервера.НастройкиОтправки(ПараметрыВыбора.КлючНастроек);
	КонецЕсли;
	
	Если Настройки <> Неопределено Тогда
		ПараметрыВыбора.МаршрутПодписания = Настройки.МаршрутПодписания;
		ПараметрыВыбора.Формат = Настройки.Формат;
		ПараметрыВыбора.ТребуетсяИзвещение = Настройки.ТребуетсяИзвещениеОПолучении;
		ПараметрыВыбора.ТребуетсяПодтверждение = Настройки.ТребуетсяОтветнаяПодпись;
		ПараметрыВыбора.ВыгружатьДопСведения = Настройки.ВыгружатьДополнительныеСведения;
		ПараметрыВыбора.ЗаполнениеКодаТовара = Настройки.ЗаполнениеКодаТовара;
		ПараметрыВыбора.ВерсияФорматаУстановленаВручную = Настройки.ВерсияФорматаУстановленаВручную;
		ПараметрыВыбора.СпособОбмена = Настройки.СпособОбмена;
		ПараметрыВыбора.Формировать = Настройки.Формировать;
		ПараметрыВыбора.ОбменБезПодписи = Настройки.ОбменБезПодписи;
	КонецЕсли;
	
	ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД("Обработка.НастройкиЭДО.Форма.НастройкаОбменаСКонтрагентом",
		ПараметрыВыбора, ПараметрыОткрытия);
		
КонецПроцедуры

// Возвращает параметры транспортных настроек ЭДО.
// 
// Возвращаемое значение:
// 	Структура:
// * КлючНастроек - см. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
// * ИдентификаторОтправителя - Строка
// * ИдентификаторПолучателя - Строка
// * НастройкаДокумента - Булево
// * ВыборУчетныхЗаписей - Булево - (служебное поле)
Функция НовыеПараметрыТранспортныхНастроек() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("КлючНастроек",             НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки());
	Параметры.Вставить("ИдентификаторОтправителя", "");
	Параметры.Вставить("ИдентификаторПолучателя",  "");
	Параметры.Вставить("НастройкаДокумента", Ложь);
	Параметры.Вставить("ВыборУчетныхЗаписей",      Истина);
	Параметры.Вставить("ИдентификаторОтправителя", "");
	Параметры.Вставить("ИдентификаторПолучателя", "");
	Параметры.Вставить("МаршрутПодписания", ПредопределенноеЗначение("Справочник.МаршрутыПодписания.ПустаяСсылка"));
	Параметры.Вставить("Формат", "");
	Параметры.Вставить("ТребуетсяИзвещение", Ложь);
	Параметры.Вставить("ТребуетсяПодтверждение", Ложь);
	Параметры.Вставить("ВыгружатьДопСведения", Ложь);
	Параметры.Вставить("ЗаполнениеКодаТовара", "");
	Параметры.Вставить("ВерсияФорматаУстановленаВручную", Ложь);
	Параметры.Вставить("СпособОбмена", ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ПустаяСсылка"));
	Параметры.Вставить("Формировать", Ложь);
	Параметры.Вставить("ОбменБезПодписи", Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Отправить каталог товаров.
// 
// Параметры:
//  Отправитель - ОпределяемыйТип.Организация
//  Получатель - ОпределяемыйТип.УчастникЭДО
//  Договор - ОпределяемыйТип.ДоговорСКонтрагентомЭДО
//  УникальныйИдентификатор - УникальныйИдентификатор
Процедура ОтправитьКаталогТоваров(Организация, Контрагент, ДоговорКонтрагента, УникальныйИдентификатор) Экспорт
	
	ПараметрыКаталогаТоваров = НастройкиОтправкиЭДОСлужебныйВызовСервера.ПараметрыКаталогаТоваровДляОтправкиПоЭДО(
		Организация, Контрагент, ДоговорКонтрагента);
	
	ИнтерфейсДокументовЭДОКлиент.СформироватьКаталогТоваров(ПараметрыКаталогаТоваров, УникальныйИдентификатор);
	
КонецПроцедуры

// Формирует соглашение по шаблону.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  Контрагент - ОпределяемыйТип.УчастникЭДО
//  Договор - ОпределяемыйТип.ДоговорСКонтрагентомЭДО
Процедура СформироватьСоглашениеПоШаблону(Организация, Контрагент, Договор) Экспорт
	
	ДанныеСоглашения = НастройкиОтправкиЭДОСлужебныйВызовСервера.СоглашениеОбОбменеЭлектроннымиДокументами(
		Организация, Контрагент, Договор);
	
	ПараметрыОткрытия = ИнтерфейсДокументовЭДОКлиент.НовыеПараметрыОткрытияЭлектронногоДокумента();
	ПараметрыОткрытия.ВидДокумента = ДанныеСоглашения.ВидДокумента;
	ПараметрыОткрытия.НовыйДокумент = Истина;
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(
		ДанныеСоглашения.НастройкаЭДО, ПараметрыОткрытия);
	
КонецПроцедуры

// Возвращает ключ записи регистра сведений НастройкиОтправкиЭлектронныхДокументов.
// 
// Параметры:
// 	Отправитель - ОпределяемыйТип.Организация
// 	Получатель - ОпределяемыйТип.УчастникЭДО
// 	Договор - ОпределяемыйТип.ДоговорСКонтрагентомЭДО
// Возвращаемое значение:
// 	РегистрСведенийКлючЗаписи.УчетныеЗаписиЭДО
Функция КлючЗаписиНастроекОтправки(Отправитель, Получатель, Договор) Экспорт
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Отправитель", Отправитель);
	ЗначенияКлюча.Вставить("Получатель", Получатель);
	ЗначенияКлюча.Вставить("Договор", Договор);
	
	Тип = Тип("РегистрСведенийКлючЗаписи.НастройкиОтправкиЭлектронныхДокументов");
	Возврат ОбщегоНазначенияБЭДКлиент.КлючЗаписиРегистраСведений(Тип, ЗначенияКлюча);
	
КонецФункции

Процедура НастроитьРегламентЭДОПрямогоОбмена(ПараметрыНастройки, Владелец = Неопределено, Оповещение = Неопределено) Экспорт
	
	ОткрытьФорму("РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Форма.НастройкиРегламентаПрямогоОбмена",
		ПараметрыНастройки, Владелец,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Функция НовыеПараметрыНастройкиРегламентаПрямогоОбмена() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Организация",                     Неопределено);
	Параметры.Вставить("СпособОбмена",                    ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ПустаяСсылка"));
	Параметры.Вставить("АдресОтправителя",                "");
	Параметры.Вставить("АдресПолучателя",                 "");
	Параметры.Вставить("УчетнаяЗаписьПредставление",      "");
	Параметры.Вставить("ИдентификаторОтправителя",        "");
	Параметры.Вставить("ИдентификаторПолучателя",         "");
	Параметры.Вставить("ВидДокумента",                    ПредопределенноеЗначение("Справочник.ВидыДокументовЭДО.ПустаяСсылка"));
	Параметры.Вставить("ВерсияФормата",                   "");
	Параметры.Вставить("ИспользоватьПодпись",             Ложь);
	Параметры.Вставить("МаршрутПодписания",               ПредопределенноеЗначение("Справочник.МаршрутыПодписания.ПустаяСсылка"));
	Параметры.Вставить("ОжидатьОтветнуюПодпись",          Ложь);
	Параметры.Вставить("ОжидатьИзвещение",                Ложь);
	Параметры.Вставить("ВыгружатьДополнительныеСведения", Ложь);
	Параметры.Вставить("ЗаполнениеКодаТовара",            "");
	Параметры.Вставить("РасширенныйРежим",                Ложь);
	Параметры.Вставить("ВерсияФорматаУстановленаВручную", Ложь);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
